In [1]:
## Pandas : data manipulation library, used for data analysis and data cleaning
## it provides two main datastructures, i.e -- Series and DataFrame.
## Series is a one-d array like object
## DataFrame is a two-d array like object, which can be thought of as a table
## DataFrame and Series
## DataFrame is mutable


import pandas as pd

In [3]:
## Series : similar to collumn in a table

s = pd.Series([1, 2, 3, 4, 5])
print("Series \n",s)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
## create a series from dictionary
s2 = pd.Series({'a': 1, 'b': 2, 'c': 3})

print("Series from dictionary \n",s2)

Series from dictionary
 a    1
b    2
c    3
dtype: int64

In [5]:
data = [10, 20, 30, 40, 50]

index = ['a', 'b', 'c', 'd', 'e']

s2 = pd.Series(data, index=index)

print("Series with custom index \n", s2)

Series with custom index
 a    10
b    20
c    30
d    40
e    50
dtype: int64

In [6]:
## Dataframe
## Cretae a Dataframe from a dictionary of list

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

In [7]:
df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
import numpy as np

np.array(df)

array([['Alice', 25, 'New York'],
       ['Bob', 30, 'Los Angeles'],
       ['Charlie', 35, 'Chicago']], dtype=object)

In [10]:
## data is available in the form of list of dictionaries



data = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles'},
    {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago'},
    {'Name': 'David', 'Age': 40, 'City': 'Houston'},
    {'Name': 'Eve', 'Age': 45, 'City': 'Phoenix'},
    {'Name': 'Frank', 'Age': 50, 'City': 'Philadelphia'},
    {'Name': 'Grace', 'Age': 55, 'City': 'San Antonio'},
    {'Name': 'Hank', 'Age': 60, 'City': 'San Diego'},
    {'Name': 'Ivy', 'Age': 65, 'City': 'Dallas'},
    {'Name': 'Jack', 'Age': 70, 'City': 'San Jose'}
]


df = pd.DataFrame(data)

In [11]:
df

      Name  Age          City
0    Alice   25      New York
1      Bob   30   Los Angeles
2  Charlie   35       Chicago
3    David   40       Houston
4      Eve   45       Phoenix
5    Frank   50  Philadelphia
6    Grace   55   San Antonio
7     Hank   60     San Diego
8      Ivy   65        Dallas
9     Jack   70      San Jose

In [12]:
type(df)

pandas.core.frame.DataFrame

In [37]:
## DataFrame : similar to table in a database

df = pd.read_csv("/Users/balmukundmishra/Desktop/2025-Learning/ML-Course/Datasets/ecommerce.csv")

In [38]:
df.head()

   ID order_date delivery_date
0   1    5/24/98        2/5/99
1   2    4/22/92        3/6/98
2   4    2/10/91       8/26/92
3   5    7/21/92      11/20/97
4   7     9/2/93       6/10/98

In [17]:
df.tail(5)

      ID order_date delivery_date
496  990    6/24/91        2/2/96
497  991     9/9/91       3/30/98
498  993   11/16/90       4/27/98
499  994     6/3/93       6/13/93
500  997     1/4/90       10/3/91

In [18]:
df['ID']

0        1
1        2
2        4
3        5
4        7
      ...
496    990
497    991
498    993
499    994
500    997
Name: ID, Length: 501, dtype: int64

In [19]:
type(df['ID'])

pandas.core.series.Series

In [26]:
df.loc[0]

ID                     1
order_date       5/24/98
delivery_date     2/5/99
Name: 0, dtype: object

In [24]:
df.iloc[0]

ID                     1
order_date       5/24/98
delivery_date     2/5/99
Name: 0, dtype: object

In [23]:
df.loc[0:2]

   ID order_date delivery_date
0   1    5/24/98        2/5/99
1   2    4/22/92        3/6/98
2   4    2/10/91       8/26/92

In [22]:
df.loc[0][0]

/var/folders/46/qv_lmdyx6j7b2zym7spyl3lm0000gn/T/ipykernel_13055/2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

1

In [27]:
df.at[2, 'ID']  # Accessing a specific cell using label

4

In [28]:
## Data manipulation with dataframe

In [29]:
df

      ID order_date delivery_date
0      1    5/24/98        2/5/99
1      2    4/22/92        3/6/98
2      4    2/10/91       8/26/92
3      5    7/21/92      11/20/97
4      7     9/2/93       6/10/98
..   ...        ...           ...
496  990    6/24/91        2/2/96
497  991     9/9/91       3/30/98
498  993   11/16/90       4/27/98
499  994     6/3/93       6/13/93
500  997     1/4/90       10/3/91

[501 rows x 3 columns]

In [30]:
df['order_date'] = pd.to_datetime(df['order_date'])

/var/folders/46/qv_lmdyx6j7b2zym7spyl3lm0000gn/T/ipykernel_13055/3368831244.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['order_date'] = pd.to_datetime(df['order_date'])

In [31]:
df

      ID order_date delivery_date
0      1 1998-05-24        2/5/99
1      2 1992-04-22        3/6/98
2      4 1991-02-10       8/26/92
3      5 1992-07-21      11/20/97
4      7 1993-09-02       6/10/98
..   ...        ...           ...
496  990 1991-06-24        2/2/96
497  991 1991-09-09       3/30/98
498  993 1990-11-16       4/27/98
499  994 1993-06-03       6/13/93
500  997 1990-01-04       10/3/91

[501 rows x 3 columns]

In [34]:
df['delivery_date'] = pd.to_datetime(df['delivery_date'])

/var/folders/46/qv_lmdyx6j7b2zym7spyl3lm0000gn/T/ipykernel_13055/184025718.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df = pd.to_datetime(df['delivery_date'])

In [35]:
df

0     1999-02-05
1     1998-03-06
2     1992-08-26
3     1997-11-20
4     1998-06-10
         ...
496   1996-02-02
497   1998-03-30
498   1998-04-27
499   1993-06-13
500   1991-10-03
Name: delivery_date, Length: 501, dtype: datetime64[ns]